#Trabalhar com iloc do Pandas
##O i do iloc quer dizer posição!!!

##José Eduardo Santarem Segundo

### importar biblioteca

In [1]:
import pandas as pd

### Conjunto de dados

In [22]:
dados={'Empresa':['Microsoft', 'Google','Apple','NVData Analytics','Amazon','Newsda','Alibaba','Samsung','JD.com'], 'Qtde Func':[190000, 140000,147000, 11,1125000,0,251000,320000,310000], 'Site':['https://www.microsoft.com/','https://www.google.com/','https://www.apple.com/','https://www.nvdata.com.br/','https://amazon.com','http://newsda.com.br/','https://www.alibabagroup.com/en/global/home','https://www.samsung.com/','https://corporate.jd.com/'],'Instagram':['@microsoft','@google','@apple','@nv_data','@amazon','@newsda.br','@alibaba.com_official','@samsung','@jd_corporate'],'Criação':[1975,1998,1976,2019,1994,2016,1999,1969,1998], 'País':['EUA','EUA','EUA','Brasil','EUA','Brasil','China', 'Coréia do Sul','China']}

In [23]:
df=pd.DataFrame(dados)

In [24]:
df

            Empresa  Qtde Func  ... Criação           País
0         Microsoft     190000  ...    1975            EUA
1            Google     140000  ...    1998            EUA
2             Apple     147000  ...    1976            EUA
3  NVData Analytics         11  ...    2019         Brasil
4            Amazon    1125000  ...    1994            EUA
5            Newsda          0  ...    2016         Brasil
6           Alibaba     251000  ...    1999          China
7           Samsung     320000  ...    1969  Coréia do Sul
8            JD.com     310000  ...    1998          China

[9 rows x 6 columns]

In [25]:
df.head(2)

     Empresa  Qtde Func                        Site   Instagram  Criação País
0  Microsoft     190000  https://www.microsoft.com/  @microsoft     1975  EUA
1     Google     140000     https://www.google.com/     @google     1998  EUA

In [26]:
df.tail(2)

   Empresa  Qtde Func  ... Criação           País
7  Samsung     320000  ...    1969  Coréia do Sul
8   JD.com     310000  ...    1998          China

[2 rows x 6 columns]

In [27]:
df.sample(2)

   Empresa  Qtde Func  ... Criação           País
7  Samsung     320000  ...    1969  Coréia do Sul
2    Apple     147000  ...    1976            EUA

[2 rows x 6 columns]

In [28]:
df['Empresa']

0           Microsoft
1              Google
2               Apple
3    NVData Analytics
4              Amazon
5              Newsda
6             Alibaba
7             Samsung
8              JD.com
Name: Empresa, dtype: object

In [30]:
df['Empresa']

0    Microsoft
1       Google
Name: Empresa, dtype: object

In [32]:
df['Site'][1:4]

1       https://www.google.com/
2        https://www.apple.com/
3    https://www.nvdata.com.br/
Name: Site, dtype: object

### Trabalhar com iloc

In [40]:
df

            Empresa  Qtde Func  ... Criação           País
0         Microsoft     190000  ...    1975            EUA
1            Google     140000  ...    1998            EUA
2             Apple     147000  ...    1976            EUA
3  NVData Analytics         11  ...    2019         Brasil
4            Amazon    1125000  ...    1994            EUA
5            Newsda          0  ...    2016         Brasil
6           Alibaba     251000  ...    1999          China
7           Samsung     320000  ...    1969  Coréia do Sul
8            JD.com     310000  ...    1998          China

[9 rows x 6 columns]

### Selecionar uma linha, um registro completo (a alinha indexada com 2)

In [39]:
df.iloc[2]

Empresa                       Apple
Qtde Func                    147000
Site         https://www.apple.com/
Instagram                    @apple
Criação                        1976
País                            EUA
Name: 2, dtype: object

### Selecionar um intervalo de linhas, [1:3], quer dizer de 1 a 2 (o 3 não é incluído)

In [45]:
df.iloc[1:3]

  Empresa  Qtde Func                     Site Instagram  Criação País
1  Google     140000  https://www.google.com/   @google     1998  EUA
2   Apple     147000   https://www.apple.com/    @apple     1976  EUA

In [46]:
df.iloc[:3]

     Empresa  Qtde Func                        Site   Instagram  Criação País
0  Microsoft     190000  https://www.microsoft.com/  @microsoft     1975  EUA
1     Google     140000     https://www.google.com/     @google     1998  EUA
2      Apple     147000      https://www.apple.com/      @apple     1976  EUA

In [47]:
df.iloc[3:]

            Empresa  Qtde Func  ... Criação           País
3  NVData Analytics         11  ...    2019         Brasil
4            Amazon    1125000  ...    1994            EUA
5            Newsda          0  ...    2016         Brasil
6           Alibaba     251000  ...    1999          China
7           Samsung     320000  ...    1969  Coréia do Sul
8            JD.com     310000  ...    1998          China

[6 rows x 6 columns]

In [51]:
df.iloc[-3:]

   Empresa  Qtde Func  ... Criação           País
6  Alibaba     251000  ...    1999          China
7  Samsung     320000  ...    1969  Coréia do Sul
8   JD.com     310000  ...    1998          China

[3 rows x 6 columns]

###Selecionando valores de uma coluna específica

In [56]:
df['Site'].iloc[:3]

0    https://www.microsoft.com/
1       https://www.google.com/
2        https://www.apple.com/
Name: Site, dtype: object

In [55]:
df['Instagram'].iloc[[2,3,5]]

2        @apple
3      @nv_data
5    @newsda.br
Name: Instagram, dtype: object

### Selecionar linhas desejadas (passamos uma lista [2,4,5] como parâmetro)

In [43]:
df.iloc[[2,4,5]]

  Empresa  Qtde Func                    Site   Instagram  Criação    País
2   Apple     147000  https://www.apple.com/      @apple     1976     EUA
4  Amazon    1125000      https://amazon.com     @amazon     1994     EUA
5  Newsda          0   http://newsda.com.br/  @newsda.br     2016  Brasil

### Observe que o segundo parâmetro do iloc são as colunas que devem ser mostradas (sempre pelo indice)

In [78]:
df

            Empresa  Qtde Func  ... Criação           País
0         Microsoft     190000  ...    1975            EUA
1            Google     140000  ...    1998            EUA
2             Apple     147000  ...    1976            EUA
3  NVData Analytics         11  ...    2019         Brasil
4            Amazon    1125000  ...    1994            EUA
5            Newsda          0  ...    2016         Brasil
6           Alibaba     251000  ...    1999          China
7           Samsung     320000  ...    1969  Coréia do Sul
8            JD.com     310000  ...    1998          China

[9 rows x 6 columns]

In [79]:
df.iloc[0:2,0:3]

     Empresa  Qtde Func                        Site
0  Microsoft     190000  https://www.microsoft.com/
1     Google     140000     https://www.google.com/

###Escolhendo as colunas (com uma lista)

In [80]:
df.iloc[:,[1,3,5]]

   Qtde Func              Instagram           País
0     190000             @microsoft            EUA
1     140000                @google            EUA
2     147000                 @apple            EUA
3         11               @nv_data         Brasil
4    1125000                @amazon            EUA
5          0             @newsda.br         Brasil
6     251000  @alibaba.com_official          China
7     320000               @samsung  Coréia do Sul
8     310000          @jd_corporate          China

### Aplicar um filtro antes de fazer o iloc

In [83]:
df[df['País']=="EUA"].iloc[:]

     Empresa  Qtde Func                        Site   Instagram  Criação País
0  Microsoft     190000  https://www.microsoft.com/  @microsoft     1975  EUA
1     Google     140000     https://www.google.com/     @google     1998  EUA
2      Apple     147000      https://www.apple.com/      @apple     1976  EUA
4     Amazon    1125000          https://amazon.com     @amazon     1994  EUA

In [84]:
df[df['País']=="EUA"].iloc[0:2,[0,3]]

     Empresa   Instagram
0  Microsoft  @microsoft
1     Google     @google

###Executar um filtro pela coluna

In [74]:
df[df.iloc[:,4]>2000]

            Empresa  Qtde Func  ... Criação    País
3  NVData Analytics         11  ...    2019  Brasil
5            Newsda          0  ...    2016  Brasil

[2 rows x 6 columns]

In [87]:
df[df.iloc[:,4]>2000].iloc[:1,2]

3    https://www.nvdata.com.br/
Name: Site, dtype: object